Tekla Open API Reference for Tekla Structures 2025
ContourPlate.ContourPlateTypeEnum Enumeration
 The contour plate types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ContourPlateTypeEnum
Public Enumeration ContourPlateTypeEnum
Members
Member name | Value | Description
UNKNOWN | 0 |  The unknown type.
PLATE | 1 |  The plate-like contour plate.
SLAB | 2 |  The slab-like contour plate.
See Also
Reference
Tekla.Structures.Model Namespace